kirisaki/s3r-llm/sdkconfig.defaults
# M5Stack AtomS3R (ESP32-S3-PICO-1-N8R8)
CONFIG_IDF_TARGET="esp32s3"

# 8MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# 8MB octal PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# The USB-C port is wired to the built-in USB Serial/JTAG controller
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
